Repository: Daniel-KM/Omeka-S-module-BlockPlus
Catalog: language/*.po
Languages: fr

source: This module requires module %1$s version %2$s or greater.
fr: Ce module requiert le module %1$s version %2$s ou supérieur.

source: The module %1$s should be upgraded to version %2$s or later.
fr: Le module %1$s doit être mis à niveau à la version %2$s ou ultérieure.

source: Create page model
fr: Créer un modèle de page

source: A simple block allows to display data via one of the templates set in the block layout settings.
fr: Un bloc simple pour afficher des données via l’un des gabarits définis dans les dispositions du bloc.

source: This block uses the options set in the {link}site settings{link_end}, unless you use the template of Omeka in the config of the block.
fr: Ce bloc utilise les options définies dans les {link}paramètres de site{link_end}, sauf si vous utilisez le gabarit Omeka dans la config du bloc.

source: Download
fr: Télécharger

source: Share by mail
fr: Partager par mail

source: Share on Facebook
fr: Partager sur Facebook

source: Share on Pinterest
fr: Partager sur Pinterest

source: Share on Twitter
fr: Partager avec Twitter

source: This block displays the messages to the visitor or user, for example for modules Bulk Export, Contact Us, Contribute, and Guest.
fr: Ce bloc affiche les messages destinés au visiteur ou à l’utilisateur, par exemple pour les modules Bulk Export, Contact Us, Contribute et Guest.

source: Choose any page from any site.
fr: Choisir une page de n’importe quel site.

source: If a page of a private site is selected, it will be hidden on the public side.
fr: Si une page d’un site privé est choisie, elle sera cachée dans la partie publique.

source: The current page and recursive pages are forbidden.
fr: La page en cours ou qui se trouve récursivement dans une autre page ne peut être choisie.

source: This block doesn’t display anything, but stores various metadata for themes. It will be removed soon and replaced by the main page metadata above.
fr: Ce bloc n’affiche rien, mais permet d’enregistrer des métadonnées pour les thèmes. Il sera supprimé prochainement et remplacé par les métadonnées de la page ci-dessus.

source: Redirect to %s
fr: Rediriger vers %s

source: Download file
fr: Télécharger le fichier

source: Print
fr: Imprimer

source: Dashboard
fr: Tableau de bord

source: Basket
fr: Panier

source: Collecting
fr: Collectes

source: Selection for contact
fr: Sélection pour contact

source: Selection
fr: Sélection

source: Login
fr: Connexion

source: Register
fr: Inscrivez-vous

source: Authentication error
fr: Erreur d’authentification

source: Update account
fr: Mettre à jour le compte

source: Update email
fr: Mettre à jour le mail

source: Accept terms
fr: Accepter les conditions

source: Current page
fr: Page en cours

source: Breadcrumb
fr: Fil d’Ariane

source: Search on map
fr: Chercher sur la carte

source: No message.
fr: Pas de message.

source: No file defined. Set the param in the block: "file = filename.tsv" (use a file inside /asset/data/) or "file = https://example.com/file.tsv".
fr: Aucun fichier défini. Indiquer le paramètre dans le block : "file = filename.tsv" (utilise le fichier dans /asset/data/) ou "file = https://example.com/file.tsv".

source: Display info
fr: Afficher les infos

source: More information
fr: Plus d’infos

source: [No date]
fr: [Pas de date]

source: Created on %s, updated on %s
fr: Créé le %s, mis à jour le %s

source: Created on %s
fr: Créée le %s

source: First
fr: Premier

source: No previous
fr: Pas de précédent

source: No next
fr: Pas de suivant

source: Last
fr: Dernier

source: Simple block to customize in theme
fr: Bloc simple pour personnalisation dans le thème

source: Download file (%s)
fr: Télécharger le fichier (%s)

source: No item
fr: Pas de contenu

source: Unavailable resource
fr: Ressource indisponible

source: Previous resource
fr: Ressource précédente

source: No previous resource
fr: Pas de ressource précédente

source: Next resource
fr: Ressource suivante

source: No next resource
fr: Pas de ressource suivante

source: The vocabulary "{vocabulary}" was updated successfully.
fr: Le vocabulaire « {vocabulary} » a été correctement mis à jour.

source: Change: The method "blockMetadata()" returns an array by default for key "params_json". Use key "params_json_object" to keep object output.
fr: Changement : la méthode "blockMetadata()" retourne désormais un "array" par défaut pour la clé "params_json". Utilisé la clé "params_json_object" pour garder la sortie objet.

source: The vocabulary "{vocabulary}" is not installed.
fr: Le vocabulaire « {vocabulary} » n’est pas installé.

source: Is reserved Access
fr: Est en accès restreint

source: Gives an ability for private resource to be previewed.
fr: Permet aux ressources privées d’être listées (prévisualisées).

source: Is new resource
fr: Est une nouvelle ressource

source: Allows to identify a resource as a new one.
fr: Permet d’identifier la ressource comme nouvelle.

source: Category
fr: Catégorie

source: Non-standard topic that can be used for some purposes.
fr: Thème non-standard pouvant être utilisé dans certains cas.

source: The block "Assets" was merged with the new upstream block "Asset".
fr: Le bloc "Fichiers" a été fusionné avec le nouveau bloc Omeka "Fichier".

source: You may have to check the pages when a specific template is used, in particular for deprecated keys "title", replaced by "alt_link_title", and "url", replaced by "page" (or hacked with caption, or alt link title, or asset title).
fr: Il est recommandé de vérifier les pages où un modèle spécifique "assets" est utilisé, en particulier pour les options "title", remplacée par "alt_link_title", et "url", remplacé par "page" (ou contourné avec "caption", "alt_link_title" ou le titre du fichier).

source: Furthermore, it is recommended to rename "assets" templates as "asset-xxx" and to update pages accordingly. You may replace the default template with "asset-block" too.
fr: De plus, il est recommandé de renommer les gabarits "assets" en "asset-xxx" et de mettre à jour les pages. Vous pouvez également remplacer le modèle par défaut avec "asset-block".

source: The block still supports html captions and media assets.
fr: Le bloc supporte toujours les légendes html et les fichiers médias.

source: It’s now possible to maximize the field "Html" in page edition.
fr: Il est désormais possible de maximiser les champs d’édition html des pages.

source: It’s now possible to add footnotes in fields "Html" in page edition.
fr: Il est désormais possible d’ajouter des pieds de page dans les champs "Html" des pages.

source: It’s now possible to choose mode of display to edit html blocks of pages in main params.
fr: Il est désormais possible de choisir le mode d’affichage pour l’édition des blocs html.

source: The output for block D3 Graph was modified. Check it if you modified the template in your theme.
fr: La sortie du bloc D3 Graph a été modifiée. Il convient de mettre à jour le thème si le fichier du thème a été modifié.

source: Template "Asset": The variable $assets has been replaced by $attachments; attachment key "title" by "alt_link_title"; attachment key "url" was removed. Check it if you customized template.
fr: Bloc "Fichier" : la variable $assets a été remplacée par $attachments ; la clé "title" a été remplacée par "alt_link_title"; la clé "url" a été supprimée. Vérifiez si vous avez modifier les fichiers du thème.

source: The key "url" of attachments of block "Asset" was removed. The block template should be updated if you customized it in pages: {html}
fr: La clé « url » des fichiers attachés du bloc « Fichier » a été supprimée. Vérifiez le fichier du thème si vous l’avez personnalisé dans les pages {html}.

source: The feature "Breadcrumbs" was moved from module "Menu" into this module. Upgrade is automatic. Check your options if you use it.
fr: La fonctionnalité « Fil d’Ariane » a été déplacée du module « Menu » vers ce module. La mise à jour est automatique. Vérifiez vos options si vous l’utilisez.

source: It is now possible to define a breadcrumbs (may need to be added inside theme).
fr: Il est désormais possible de définir un fil d’Ariane (il peut être nécessaire de l’ajouter dans le thème).

source: Two new resource page blocks has been added, in particular to display buttons to previous and next resource (require module Easy Admin).
fr: Deux nouveaux blocs de pages de ressources ont été ajoutés, notamment pour afficher les boutons vers la ressource précédente et la ressource suivante (nécessite le module Easy Admin).

source: The block "Separator" was replaced by the Omeka block "Line Break" with block class "transparent" and layout class "separator".
fr: Le bloc « Séparateur » a été remplacé par le bloc Omeka « Saut de ligne » avec la classe de bloc « transparent » et la classe de gabarit « separator ».

source: The options "alignment" and "divclass" of some blocks were moved to block layout.
fr: Les options « alignment » et « divclass » de certains blocs ont été déplacées vers le options de disposition des blocs.

source: Site {site_slug} / Page {page_slug}: Type "intermediate" and "end" divisions must be after a block "start" or "intermediate".
fr: Site {site_slug} / Page {page_slug} : Les divisions de type « intermédiaire » et « fin » doivent être situées après un bloc « début » ou « intermédiaire ».

source: Site {site_slug} / Page {page_slug}: Unauthorized type "{type}" for block division.
fr: Site {site_slug} / Page {page_slug} : Type non autorisé « {type} » pour le bloc de division.

source: Site {site_slug} / Page {page_slug}: A block "division" cannot be single.
fr: Site {site_slug} / Page {page_slug} : Un bloc « division » ne peut pas être utilisé seul.

source: Site {site_slug} / Page {page_slug}: The first division block must be of type "start".
fr: Site {site_slug} / Page {page_slug} : Le premier bloc de division doit être de type « début ».

source: Site {site_slug} / Page {page_slug}: The last division block must be of type "end".
fr: Site {site_slug} / Page {page_slug} : Le dernier bloc de division doit être de type « fin ».

source: Site {site_slug} / Page {page_slug}: Some divisions have no end.
fr: Site {site_slug} / Page {page_slug} : certaines divisions n’ont pas de fin.

source: Site {site_slug} / Page {page_slug}: The migration does not manage nested divisions. You should finalize migration of the page manually, for example with grid and block groups.
fr: Site {site_slug} / Page {page_slug} : la migration ne gère pas les divisions imbriquées. Vous devez finaliser la migration de la page manuellement, par exemple avec des grilles et les groupes de blocs.

source: The blocks Division were replaced by a group of blocks when possible (not nested). See messages above or logs for issues.
fr: Les blocs Division ont été remplacés par un groupe de blocs lorsque cela était possible (non imbriqués). Voir les messages ci-dessus ou les journaux pour les problèmes.

source: The setting "html" was removed from block Browse Preview. A new block "Html" was prepended to all blocks that had a filled html. You may check pages for styles: {json}
fr: Le paramètre « heading » a été supprimé des blocs. Un nouveau bloc « Html Heading » a été ajouté à tous les blocs qui avaient un titre rempli. Vous pouvez vérifier les styles des pages : {json}

source: The block Browse Preview is no more managed by this module. If you used specific settings, use the block Search Results.
fr: Le bloc « Aperçu des ressources » n’est plus géré par ce module. Vérifiez vos thèmes si vous l’avez utilisé ou utilisez le bloc Résultats de recherche.

source: The block "Browse Preview" filled with specific features (query with specific site, pagination and sort headings) were replaced by block Search results and template "search-results-browse-preview-deprecated": {json}
fr: Le bloc « Aperçu des ressources » qui utilisait des fonctionnalités spécifiques (requête avec site spécifique, pagination et titres de tri) a été remplacé par le bloc Search results et le gabarit « search-results-browse-preview-deprecated » : {json}

source: The setting "heading" was removed from blocks. A new block "Heading" was prepended to all blocks that had a filled heading. You may check pages for styles: {json}
fr: Le paramètre « heading » a été supprimé des blocs. Un nouveau bloc « Html Heading » a été ajouté à tous les blocs qui avaient un titre rempli. Vous pouvez vérifier les styles des pages : {json}

source: A new block "Heading" allows to separate blocks with a html heading and replaces previous blocks with setting "heading".
fr: Un nouveau bloc « Heading » permet de séparer les blocs avec un titre html. Il remplace les blocs précédents qui contenait le paramètre html « heading ».

source: The old block "Page Date" was replaced by the core one "Page Date Time". The variable names were changed, so check your theme if needed.
fr: L’ancien bloc « Date de la page » a été remplacé par le bloc Omeka S « Date et heure de la page ». Les noms des variables ont été modifiés, il convient donc de vérifier votre thème si nécessaire.

source: For block Asset, the keys "class" and "url" of assets were moved to the start of the caption and available only with specific block templates.
fr: Pour le bloc Fichier, les éléments « class » et « url » des fichiers attachés ont été déplacées au début de la légende et disponibles seulement avec les gabarits spécifiques.

source: The block Item Showcase was renamed Media in Omeka S v4.1. The option "linkType" was renamed "link". Check your themes to update them.
fr: Le bloc Vitrine de contenu a été renommé Media dans Omeka S v4.1. L’option « linkType » a été renommée « link ». Vérifiez vos thèmes pour les mettre à jour.

source: The templates item-showcase-xxx were renamed media-item-showcase-xxx. Check your themes to update them or to move them to common/block-template and to add them in theme.ini as templates for block "Media".
fr: Les gabarits item-showcase-xxx ont été renommés media-item-showcase-xxx. Vérifiez vos thèmes pour les mettre à jour ou pour les déplacer dans common/block-template et les ajouter dans theme.ini comme gabarits pour le bloc « Media ».

source: The old template mechanism of the module BlockPlus was replaced by the new mechanism of Omeka S v4.1.
fr: L’ancien mécanisme de gabarit du module BlockPlus a été remplacé par le nouveau mécanisme d’Omeka S v4.1.

source: It is recommended to check your themes and to move specific templates from "view/common/block-layout" to "view/common/block-template" and to declare them in the file theme.ini. This is not needed for the default template of a block. After moving, the option "template" of each block should be updated in each page.
fr: Il est recommandé de vérifier vos thèmes et de déplacer les gabarits spécifiques de « view/common/block-layout » vers « view/common/block-template » et de les déclarer dans le fichier theme.ini. Cela est inutile pour le gabarit par défaut des blocs. Après le déplacement, l’option « template » de chaque bloc doit être mise à jour dans chaque page.

source: Because old features of the module were integrated inside Omeka S since v4.1 ({link}user doc{link_end}, {link_2}dev doc{link_end}), the blocks Asset, Browse Preview, Html, Item Showcase, Item With Metadata, List of Pages, Page Date, and Page Title are no more overridden.
fr: Les anciennes fonctionnalités du module ayant été intégrées dans Omeka S depuis la version 4.1 ({link}doc utilisateur{link_end}, {link_2}doc développeur{link_end}), les améliorations des blocs Aperçu des ressources, Fichier, Html, Vitrine de contenus, Contenus avec métadonnées, Liste des pages, Dates de la page et Titre de la page ne sont plus prises en charge par le module.

source: Warning: It is important to check all site pages because the integration of the module features in Omeka S is a complex process and some features are not upgradable.
fr: Attention : il est important de vérifier toutes les pages de site car l’intégration des fonctionnalités du module dans Omeka S est un processus complexe et certaines fonctionnalités n’ont pas été conservées.

source: In particular, check deprecated block templates and blocks Asset, Browse Preview and nested Division. Check styles too, because some html <div> and classes were added or removed by Omeka S and the module. Warning: as long as you do not re-save a page, old page settings will work. Once saved a new time, some old settings will be removed.
fr: En particulier, vérifier les gabarits obsolètes des blocs et les blocs Fichier, Aperçu des ressources et Division (imbriquée). Vérifiez également les styles, car certaines <div> html et classes ont été ajoutées ou supprimées par Omeka S et le module. Attention : tant que vous ne resauvez pas une page, les anciens paramètres fonctionnent. Une fois enregistrée une nouvelle fois, certains anciens paramètres sont supprimés.

source: The template name of some of the blocks {list} where renamed for deprecation. Check your theme if you use them. Matching pages: {json}
fr: Le nom du gabarit de certains blocs {list} a été renommé pour des raisons d’obsolescence. Vérifiez votre thème si vous les utilisez. Pages correspondantes : {json}

source: The setting "heading" was removed from blocks Search Results. A new block "Heading" was prepended to all blocks that had a filled heading. You may check pages for styles: {json}
fr: Le paramètre « titre du bloc » a été supprimé des blocs. Un nouveau bloc « Titre » (Html Heading) a été ajouté à tous les blocs qui avaient un titre rempli. Vous pouvez vérifier les styles des pages : {json}

source: These templates for block "Html" should contain `$block->dataValue('html', '')` because `$html` is no more available by default. Matching files: {json}
fr: Ces gabarits pour le bloc « Html » devraient contenir `$block->dataValue('html', '')` car `$html` n’est plus disponible par défaut. Fichiers correspondants : {json}

source: The block "Browse Preview" do not have the variable `$site` anymore. Check your theme if you customized it. Matching pages: {json}.
fr: Le bloc « Aperçu des ressources » n’a plus la variable `$site`. Vérifiez votre thème si vous l’avez personnalisé. Pages correspondantes : {json}.

source: The template layout of some blocks was renamed. Check your theme if you used them. Matching pages: {json}.
fr: Le gabarit de certains blocs a été renommé. Vérifiez votre thème si vous l’avez personnalisé. Pages correspondantes : {json}.

source: The data of blocks "Asset" were migrated to manage asset class and url as the first two lines of the caption. Update your theme like asset templates. Matching pages: {json}.
fr: Les données des blocs « Fichier » ont été migrées pour gérer les classes et les urls de chaque fichier via les deux premières lignes de la légende. Mettez à jour votre thème si besoin comme les autres gabarits du bloc Fichier. Pages correspondantes : {json}.

source: The setting "heading" was removed from block Media. A new block "Heading" was prepended to all blocks that had a filled heading. You may check pages for styles: {json}
fr: Le paramètre « heading » a été supprimé du bloc Media. Un nouveau bloc « Titre Html » a été ajouté à tous les blocs qui avaient un titre rempli. Vous pouvez vérifier les styles des pages : {json}

source: The block Resource Text has been converted to a group of blocks Media and Html. The option "caption position" was moved to layout class. You may check pages for styles: {json}
fr: Le bloc Ressource avec texte a été converti en un groupe de bloc Media et Html. L’option « position de la légende » a été déplacée dans une classe du gabarit. Vous pouvez vérifier les pages pour les syles : {json}

source: The variables "$html" and "$captionPosition" were removed from block Resource Text (converted into block Media). You should fix them: {json}
fr: Les variables « $html » et « $captionPosition » ont été supprimés du bloc Ressource avec texte (converti en un bloc Média). Vous devez les corriger : {json}

source: The option "type" of block Page Metadata was migrated to page layout option and page templates were added. Update your theme if needed. Matching pages: {json}.
fr: L’option « type » du bloc « Métadonnées de la page » a été migrée dans l’option Modèle de page et les modèles de page correspondants ont été ajoutés. Mettez à jour votre thème si besoin. Pages correspondantes : {json}.

source: The option "type" of block Page Metadata cannot be migrated because a page layout template was already set. Matching pages: {json}.
fr: L’option « type » du bloc Métadonnées de la page ne peut pas être migrée car un modèle de gabarit est déjà défini pour la page. Pages correspondantes : {json}.

source: All themes that contain custom templates of the blocks should be moved from "view/common/block-layout" to "view/common/block-template" except if they override the default one with the same name. See {link}readme{link_end} for more information about migration.
fr: Pour tous les thèmes, les gabarits personnalisés des blocs doivent être déplacés de « view/common/block-layout » vers « view/common/block-template », sauf s’ils conservent le même nom que le bloc par défaut. Consultez le {link}lisez-moi{link_end} pour plus d’informations sur la migration.

source: New resource blocks allow to wrap other blocks with html elements <div> and <section>.
fr: De nouveaux blocs de ressources permettent de grouper d’autres blocs avec les éléments html <div> et <section>.

source: It is now possible to append a list of blocks via a simple click when editing a site page.
fr: Il est désormais possible d’ajouter une liste de blocs via un simple clic lorsque la page est modifiée.

source: If you created some lists of blocks in version 3.4.25, the block group is no more implicit, so you should update each group manually: prepend `o:block.0.o:layout = "blockGroup"` and prepend `blocks.0.` to optional root `o:layout_data`. Furthermore, the key "block_groups" in config was renamed "page_models".
fr: Si vous avez créé une liste deblocs dans la version 3.4.25, le bloc Groupe n’est plus implicite et vous devez donc l’ajouter manuellement à chaque groupe : ajoutez `o:block.0.o:layout = "blockGroup"` et préfixez `blocks.0.` aux valeurs `o:layout_data` situées à la racine. De plus, la clé « block_groups » a été renommée « page_models ».

source: It is now possible to select a page model with page settings and blocks when creating a new page.
fr: Il est désormais possible de choisir un modèle de page avec les paramètres et les blocs lors de la création d’une nouvelle page.

source: It is now possible to create a page model or a list of blocks via a simple click when editing a page.
fr: Il est désormais possible de créer un modèle de page ou une liste de blocs d’un simple clic lorsque la page est modifiée.

source: A new site setting allows to permit site editors to create page models and blocks groups.
fr: Un nouveau paramètre de site permet d’autoriser les éditeurs de site à créer les modèles de page et des groupes de blocs.

source: New templates were added to block html in order to display an accordion and a dialog box.
fr: De nouveaux gabarits ont été ajoutés au bloc html pour afficher un accordéon et une boîte de dialogue.

source: The setting "html" was removed from block External Content and Search Form. A new block "Html" was prepended to all blocks that had a filled html. You may check pages for styles: {json}
fr: Le paramètre « html » a été supprimé des blocs Contenu externe et Formulaire de recherche. Un nouveau bloc « Html » a été ajouté à tous les blocs qui avaient un html rempli. Vous pouvez vérifier les styles des pages : {json}

source: New templates were added to blocks Showcase, External Content and Search form.
fr: De nouveaux gabarits ont été ajoutés au bloc Vitrine, Contenu externe et Formulaire de recherche.
