Repository: Daniel-KM/Omeka-S-module-BlockPlus
Catalog: language/*.po
Languages: fr

source: Block Plus: Resource text (deprecated)
fr: Block Plus : Ressource avec texte (obsolète)

source: Block Plus: Page date time
fr: Block Plus : Page date heure

source: Block Plus: Table of contents (deprecated)
fr: Block Plus : Table des matières (obsolète)

source: Collapse the list of groups of blocks
fr: Replier la liste des groupes de blocs

source: Expand to display the list of groups of blocks
fr: Déplier pour afficher la liste des groupes de blocs

source: Insert Footnotes
fr: Insérer des pieds de page

source: Please wait for previous group of blocks to be prepared before adding a new one.
fr: Veuillez attendre la finalisation du groupe de blocs précédent avant d’en ajouter un autre.

source: This group does not contain any block.
fr: Ce groupe ne contient aucun bloc.

source: Url (deprecated)
fr: Url (obsolète)

source: Know more
fr: En savoir plus
