Repository: Daniel-KM/Omeka-S-module-BlockPlus
Catalog: language/*.po
Languages: fr

source: The block Page metadata is deprecated in favor of an integrated form and will be removed in a future version. The metadata will be available as standard rdf data too.
fr: Le bloc Métadonnées de la page est obsolète et remplacé par le formulaire intégré au niveau de la page. Il sera supprimé dans une prochaine version. Les métadonnées seront également disponibles au standard rdf.

source: The setting "show title" was replaced by components (title, body, thumbnail) in block Item Set Showcase. You may check pages: {json}
fr: Le paramètre « Afficher le titre » a été remplacé par des composants (titre, corps, vignette) dans le bloc Vitrine de collections. Vous pouvez vérifier les pages : {json}

source: The setting "show title" was replaced by components (title, body, thumbnail) in block Item Set Showcase.
fr: Le paramètre « Afficher le titre » a été remplacé par des composants (titre, corps, vignette) dans le bloc Vitrine de collections.

source: The js library "ThumbnailGridExpandingPreview" was renamed "thumbnail-grid-expanding-preview". You should fix your theme: {json}
fr: La bibliothèque js « ThumbnailGridExpandingPreview » a été renommé « thumbnail-grid-expanding-preview ». Vous devez corriger votre thème : {json}

source: A sub-template was added to display the block browse preview gallery with thumbnail "medium".
fr: Un sous-gabarit a été ajouté pour afficher le bloc Aperçu des ressources (gallerie) avec la vignette « moyenne ».

source: The setting "components" of blocks Item Set Showcase and Search Results were updated: to set empty components now means no component. You may check pages: {json}
fr: Le paramètre Composants des blocs Vitrine de collections et Résultats de recherche ont été mis à jour : n’en indiquer aucun signifie désormais n’en afficher aucun. Vous pouvez vérifier les pages : {json}

source: A resource block was added to be displayed when no item or no media is available.
fr: Un bloc de ressource peut être affiché quand aucun contenu ou média n’est disponible.

source: The block Showcase has now a setting "components", the key "title" was renamed "heading", and option "media_display" was removed. The field html was re-upgraded. You may check pages: {json}
fr: Le bloc Vitrine a désormais une option Composants. La clé "title" a été renommée "heading". L’option "media_display" a été supprimée. Le champ html a été remis à jour. Vous pouvez vérifier les pages : {json}

source: The block Showcase has now a setting "components".
fr: Le bloc Vitrine a désormais une option Composants.

source: The javascript library should be installed. See module’s installation documentation.
fr: Une bibliothèque javascript doit être installée. Consulter la documentation d’installation du module.

source: The page model "{page_model}" does not exist.
fr: Le modèle de page « {page_model} » n’existe pas.

source: Blocks only
fr: Blocs seuls

source: Full page
fr: Page complète

source: Main settings
fr: Paramètres généraux

source: Site settings
fr: Paramètres du site

source: Theme settings
fr: Paramètres du site

source: Theme settings (unsupported)
fr: Paramètres du thème (non pris en charge)

source: Save as page model or blocks groups
fr: Sauvegarde comme modèle de page ou groupe de blocs

source: If a label is set, the model will be stored when the current page will be saved.
fr: Si un libellé est indiqué, le modèle sera enregistré en même temps que la page.

source: "{name}" is already used as page model and was renamed "{name_2}".
fr: « {name} » est déjà utilisé comme modèle de page et a été renommé « {name_2} ».

source: The page models can’t contain a value with a double quote (")
fr: Les modèles de page ne peuvent pas contenir une valeur avec des guillemets droits (").

source: The blocks group cannot be stored in the theme settings: the theme does not support it. See {link}readme{link_end}.
fr: Les groupes de blocs ne peuvent pas être enregistrés dans les paramètres du thème : le thème ne les gère pas. Voir {link}lisez-moi{link_end}.

source: The page model "{label}" ({name}) was saved in theme settings.
fr: Le modèle de page « {label} » ({name}) a été enregistré dans les paramètres du thème.

source: The blocks group "{label}" ({name}) was saved in theme settings.
fr: Le groupe de blocs « {label} » ({name}) a été enregistré dans les paramètres du thème.

source: The page model "{label}" ({name}) was saved in site settings.
fr: Le modèle de page « {label} » ({name}) a été enregistré dans les paramètres du site.

source: The blocks group "{label}" ({name}) was saved in site settings.
fr: Le groupe de blocs « {label} » ({name}) a été enregistré dans les paramètres du site.

source: The page model "{label}" ({name}) was saved in main settings.
fr: Le modèle de page « {label} » ({name}) a été enregistré dans les paramètres généraux.

source: The blocks group "{label}" ({name}) was saved in main settings.
fr: Le groupe de blocs « {label} » ({name}) a été enregistré dans les paramètres généraux.

source: Page models and blocks groups
fr: Modèles de page et groupes de blocs

source: Page metadata
fr: Métadonnées de la page

source: Credits
fr: Crédits

source: Tags
fr: Mots-clés

source: Comma-separated list of keywords
fr: Liste de mots-clés séparés par des virgules

source: Featured
fr: En vedette

source: Is new
fr: Est nouveau

source: Params
fr: Paramètres

source: The params can be fetched as raw text, key/value pairs, or json depending on theme.
fr: Les paramètres peuvent être récupérés en tant que texte brut, paires clé/valeur et json selon le thème.

source: The template "asset-deprecated-plus" should be replaced by "asset-class-url" in page {url}.
fr: Le modèle « asset-deprecated-plus » doit être remplacé par « asset-class-url » dans la page {url}.

source: The template "asset-left-right" should be replaced by new page block features in page {url}.
fr: Le modèle « asset-left-right » doit être remplacé par les nouvelles fonctionnalités des blocs dans la page {url}.

source: Since Omeka S 4.1, the metadata "type" is replaced by the page template name (key "template"). Check your theme.
fr: Depuis Omeka S 4.1, la métadonnée the metadata « type » a été remplacée par le nom du gabarit de page (clé « template »). Vérifiez votre thème.

source: Breadcrumbs
fr: Fil d’Ariane

source: Block plus resources
fr: Block Plus ressources

source: Allow site editor to create page models and groups of blocks
fr: Autoriser l’éditeur de site à créer des modèles de page et des groupes de blocs

source: Skip page models defined internally by the module Block Plus
fr: Ignorer les modèles de page définis par le module Block Plus

source: Default page models are mainly used as examples or for upgrade from Omeka Classic: home_page, exhibit, exhibit_page, simple_page and resource_text.
fr: Les modèles de page par défaut sont principalement utilisés comme des exemples ou pour la mise à niveau depuis Omeka Classic : home_page, exhibit, exhibit_page, simple_page et resource_text.

source: Page models and groups of blocks
fr: Modèles de page et groupes de blocs

source: List all page models and blocks groups formatted as ini with a section for each group.
fr: Liste des modèles de page et des groupes de blocs formatés en ini avec une section pour chaque groupe.

source: Crumbs
fr: Éléments du fil d’Ariane

source: Prepend home
fr: Ajouter la page d’accueil au début

source: Include "Collections"
fr: Inclure « Collections »

source: Include main item set for item
fr: Inclure la collection principale du contenu

source: Include item sets tree
fr: Inclure l’arborescence des collections

source: Append current resource
fr: Ajouter la ressource en cours

source: Append current resource as a link
fr: Ajouter la ressource en cours en tant que lien

source: Prepended links
fr: Liens à ajouter au début

source: List of urls followed by a label, separated by a "=", one by line, that will be prepended to the breadcrumb.
fr: Liste des urls suivis par un libellé, séparés par un « = », une par ligne, qui seront ajoutées au fil d’Ariane.

source: Url for collections
fr: Url pour les collections

source: The url to use for the link "Collections", if set above. Let empty to use the default one.
fr: L’url à utiliser pour le lien « Collections », si ajouté ci-dessus. Laisser vide pour utiliser l’url par défaut.

source: Separator
fr: Séparateur

source: The separator between crumbs may be set as raw text or via css. it should be set as an html text ("&gt;").
fr: Le séparateur entre les éléments du fil d’Ariane doit être indiqué en tant que texte brut ou via les css. Il doit être indiqué comme chaîne html (« &gt; »).

source: Display on home page
fr: Afficher sur la page d’accueil

source: Settings for the resource block Buttons
fr: Paramètres pour le bloc de ressources Boutons

source: Share by email
fr: Partager par mail

source: Share on Twitter (now X)
fr: Partager avec Twitter (désormais X)

source: Default items order in each item set
fr: Ordre des contenus dans chaque collection

source: Set order for item set, one by row, format "id,id,id property order". Use "0" for the default.
fr: Indiquer l’ordre pour chaque collection, une par ligne, selon le format « id,id,id ordre de la propriété ». Utiliser « 0 » pour l’ordre par défaut.

source: Query to limit and sort the list of items for the previous/next buttons
fr: Requête pour limiter et trier la liste des contenus pour les boutons précédent/suivant

source: Use a standard query. Arguments from module Advanced Search are supported if present and needed.
fr: Utiliser une requête standard. Les arguments du module Advanced Search sont pris en charge si présents et nécessaires.

source: Query to limit and sort the list of item sets for the previous/next buttons
fr: Requête pour limiter et trier la liste des collections pour les boutons précédent/suivant

source: Thumbnail type
fr: Type de vignette

source: Html edition mode for pages
fr: Mode d’édition html pour les pages

source: Inline (default)
fr: En ligne (défaut)

source: Document (maximizable)
fr: Document (maximisable)

source: Html edition config and toolbar for pages
fr: Configuration de l’éditeur html pour les pages

source: Property to set primary item set
fr: Propriété utilisée pour définir la collection principale

source: When an item is included in multiple item sets, the main one may be determined by this property.
fr: Quand un contenu est inclus dans plusieurs collections, la principale peut être déterminée par cette propriété.

source: Select a property…
fr: Choisir une propriété…

source: Link to display
fr: Lien à afficher

source: Formatted as "/url/full/path Label of the link".
fr: Formaté comme « /url/chemin/complet Libellé du lien ».

source: Main filter
fr: Filtre principal

source: Resource classes
fr: Classes de ressource

source: Search config page (module Advanced Search)
fr: Page de configuration de la recherche (module Recherche avancée)

source: Search config of the site
fr: Configuration de la recherche du site

source: Select a search engine…
fr: Choisir un moteur de recherche…

source: Page models
fr: Modèles de page

source: Blocks groups
fr: Groupes de blocs

source: Search pool query
fr: Requête de recherche

source: Used to restrict resources to search, for example on an item set.
fr: Permet de limiter les ressources, par exemple à une collection.

source: Show pagination to browse all resources on the same page.
fr: Afficher la pagination pour afficher toutes les ressources sur la même page.

source: Sort headings
fr: En-têtes de tri

source: Display sort links for the list of results.
fr: Afficher les liens de tri pour les résultats.

source: Resource template for sort headings
fr: Modèle de ressource pour le tri

source: If set, the alternative labels of this resource template will be used to display the sort headings.
fr: Si indiqué, les labels alternatifs du modèle de ressource seront utilisés pour le tri.

source: Select resource template…
fr: Choisir un modèle de ressource…

source: Search form
fr: Champ de recherche

source: The params are passed directly to the block layout.
fr: Les paramètres sont passés directement au gabarit du bloc.

source: Root resource id
fr: Id de la ressource racine

source: The root of the structure. Can be an item, an item set or any other resource type.
fr: La racine de l’arborescence. Peut être un contenu, une collection ou n’importe quel autre type de ressource.

source: Property for structure
fr: Propriété pour la structure

source: Generally, it is "dcterms:hasPart".
fr: Il s’agit généralement de "dcterms:hasPart".

source: Level expanded
fr: Profondeur initiale

source: Set 0 to start closed, a big number to display all levels.
fr: Indiquer 0 pour afficher l’arborescence fermée, un grand nombre pour afficher tous les niveaux.

source: Account
fr: Compte

source: Authorization token (bearer)
fr: Jeton d’autorisation (bearer)

source: You may need to set a token, not necessarily the account one. It may be an anonymous one.
fr: Vous devez définir votre jeton personnel, pas forcément celui du compte. Cela peut être un jeton anonyme.

source: Twitter api version
fr: Version de l’api Twitter

source: According to Twitter, you may require to create an app inside dev account. In some cases, api 1.1 doesn’t require it.
fr: Selon Twitter, il peut être nécessaire de créer une application dans le compte développeur. Dans certains cas, ce n’est pas nécessaire avec l’api 1.1.

source: Number of messages
fr: Nombre de messages

source: Display retweets
fr: Afficher les retweets

source: Url (oEmbed or iframe)
fr: Url (oEmbed ou iframe)

source: The standard "oEmbed" normalizes the integration of external resources. Main third parties are supported. Set the url to be used for the iframe.
fr: Le standard "oEmbed" normalise l’integration des ressources externes. Les principaux sites tiers sont gérés. Indiquer l’url à utiliser pour l’iframe.

source: Show title
fr: Afficher le titre

source: Link url
fr: Lien pour l’url

source: List from root
fr: Liste depuis la racine

source: If set, all the pages will be displayed, else only the ones from the current page.
fr: Si coché, toutes les pages seront affichées, sinon seulement celles situées dans l’arborescence de la page en cours.

source: Level
fr: Niveau

source: Show attachment title (when heading is included above)
fr: Titre de la pièce jointe (quand le composant "entête" est inclus)

source: Buttons
fr: Boutons

source: Main site
fr: Site par défaut

source: Current site
fr: Site en cours

source: Translated sites
fr: Sites traduits

source: Exclude sites
fr: Exclure des sites

source: Redirect the current page to this url
fr: Rediriger la page vers cette url

source: The params can be fetched as raw text, key/value pairs, or json.
fr: Les paramètres peuvent être récupérés en tant que texte brut, paires clé/valeur et json.

source: Cover image
fr: Vignette de la page

source: Private sites are marked with a "*". If a private page is selected, it will be hidden on the public site. The current page and recursive pages are forbidden.
fr: Les sites privés sont indiqués avec une "*". Si une page privée est choisie, elle sera cachée au public. La pacte courante et les pages qui la contiennent récursivement sont interdites.

source: Params type
fr: Type des paramètres

source: Automatic
fr: Automatique

source: Raw string
fr: Plein texte

source: Associative array of key / value pairs (separated with "=")
fr: Liste associative de paires clé / valeur (séparées par =)

source: List of arrays with two values, the key and the value (separated with "=")
fr: Liste de listes avec deux valeurs, la clé et la valeur (séparées par =)

source: Links
fr: Liens

source: Select a page model…
fr: Choisir le modèle de page…

source: Download primary media
fr: Télécharger le média principal

source: Linked resources by item set
fr: Ressources liées par collection

source: Html section (start)
fr: Html section (début)

source: No Media
fr: Pas de média

source: Simple block for theme
fr: Bloc simple pour le thème

source: Html div (start)
fr: Html div (début)

source: Buttons Previous / Next
fr: Boutons « Précédent/Suivant »

source: Html section (end)
fr: Html section (fin)

source: Html div for tools (end)
fr: Html div pour les outils (fin)

source: No Item
fr: Pas de contenu

source: Media part of item
fr: Média partie du contenu

source: Html div (end)
fr: Html div (fin)

source: Html div for tools (start)
fr: Html div pour les outils (début)

source: Showcase
fr: Vitrine

source: The search config "{search_slug}" has no form associated.
fr: La configuration de recherche « {search_slug} » n’a pas de formulaire associé.

source: Page metadata (deprecated)
fr: Métadonnées de la page (obsolète)

source: Map by search
fr: Carte par recherche

source: Redirect to url
fr: Rediriger vers l’url

source: Cannot index and/or render a table of contents block in a mirror page for now: %s.
fr: Impossible d’indexer ou de rendre un bloc "table des matières" dans une page miroir actuellement : %s.

source: Mirror page
fr: Page miroir

source: A page should be selected to create a mirror page.
fr: Une page doit être sélectionnée pour créer un bloc Page miroir.

source: A mirror page cannot be inside itself.
fr: Une page miroir ne peut pas être à l’intérieur d’elle-même.

source: A mirror page cannot use a page that uses it recursively as a block.
fr: Une page miroir ne peut pas utiliser une page qui l’utilise récursivement dans un bloc.

source: Mirror page block #{block_id} in site {site_slug} and page {page_slug} should be updated: it refers to a removed page.
fr: Le bloc Page miroir #{block_id} dans le site {site_slug} pour la page {page_slug} doit être mis à jour : il fait référence à une page supprimée.

source: Cannot render this mirror page for now: {exception}.
fr: Impossible de rendre la page miroir actuellement : {exception}.

source: Search form and results
fr: Champ de recherche et résultats

source: Simple Block
fr: Bloc simple

source: Tree structure of resources
fr: Arborescence de ressources

source: D3 Graph
fr: D3 Graphe

source: A list of resources as json queries by resource name should be defined for block D3 Graph in page {page_url}.
fr: Il convient d’indiquer une liste de ressources par type de ressource, via des requêtes formatées en json, pour le bloc D3 Graph de la page {page_url}.

source: No Twitter authorization token is set, so the default one is used.
fr: Aucun jeton d’autorisation n’est défini, le jeton par défaut est donc utilisé.

source: The Twitter account "%s" is not available.
fr: Le compte Twitter "%s" est indisponible.

source: The token may be restricted to v2 or no app may be defined: try api v1.1.
fr: Le jeton peut être restreint à la v2 ou aucune application n’est définie : merci d’essayer l’api v1.1.

source: The Twitter account "%s" is available, but has no message currently, or the rate limit has been reached.
fr: Le compte Twitter "%s" est disponible, mais n’a pas de message actuellement ou le seuil maximum a été atteint.

source: The Twitter account "%s" is available and have messages.
fr: Le compte Twitter "%s" est disponible et a des messages.

source: A Twitter account is required to fetch messages.
fr: Un compte Twitter est nécessaire pour récupérer des messages.

source: The twitter block for page "{page_slug}" in site "{site_slug}" has no account set.
fr: Le bloc Twitter pour la page « {page_slug} » dans le site « {site_slug} » n’a pas de compte défini.

source: Error for block Twitter: No response.
fr: Erreur pour le block Twitter : pas de réponse.

source: Error for block Twitter: {error}. Check token.
fr: Erreur pour le bloc Twitter : {error}. Merci de vérifier le jeton.

source: Error for block Twitter: {error}. Check token or use api v1.
fr: Erreur pour le bloc Twitter : {error}. Merci de vérifier le jeton ou d’utiliser l’api v1.

source: Item set showcase
fr: Vitrine de collections

source: External content
fr: Contenu externe

source: Invalid OEmbed URL
fr: Url oEmbed invalide

source: OEmbed URL
fr: Url oEmbed

source: OEmbed URL unavailable
fr: Url oEmbed indisponible

source: No OEmbed links were found at the given URI
fr: Aucun lien oEmbed n’a été trouvé dans l’uri indiquée

source: OEmbed link URL
fr: Lien url oEmbed

source: OEmbed link URL unavailable
fr: L’url du lien oEmbed est indisponible

source: Error decoding OEmbed JSON
fr: Erreur lors du décodage du json oEmbed

source: Invalid "%s" specified
fr: Spécification "%s" invalide

source: Error reading %s: %s (%s)
fr: Erreur lors de la lecture %s: %s (%s)

source: Home page
fr: Page d’accueil

source: A page model with blocks browse preview with a template for gallery, html, heading, and asset.
fr: Un modèle de page avec les blocs Aperçu des ressources avec le modèle Galerie, Html, Titre et Fichier.

source: Exhibit
fr: Exposition

source: A page model for an exhibit summary, with blocks page title, html, heading, and list of pages.
fr: Un modèle de page pour un sommaire d’exposition, avec les blocs Titre de page, Html, Titre et liste des pages.

source: Exhibit page
fr: Page d’exposition

source: A page model for an exhibit page, with blocks page title, html, heading and media.
fr: Un modèle de page pour une page d’exposition, avec les blocs Titre de page, Html, Titre et Média.

source: A page model for generic needs, with blocks page title and html.
fr: Un modèle de page générique avec un bloc Titre de page et un bloc Html.

source: Resource with text
fr: Ressource avec texte

source: A group of blocks with a heading, a media and a field for html.
fr: Un groupe de blocs avec un titre, un média et un champ html.

source: Block Plus: Home page
fr: Block Plus : Page d’accueil

source: Block Plus: Exhibit
fr: Block Plus : Exposition

source: Block Plus: Exhibit page
fr: Block Plus : Page d’exposition

source: Block Plus: Simple page
fr: Block Plus : Page simple

source: Block Plus: Asset with class and url
fr: Block Plus : Fichier avec classe et url

source: Block Plus: Partners
fr: Block Plus : Partenaires

source: Block Plus: Skip
fr: Block Plus : Ignorer

source: Block Plus: Asset (deprecated)
fr: Block Plus: Fichier (obsolète)

source: Block Plus: Glossary
fr: Block Plus : Glossaire

source: Block Plus: Omeka breadcrumbs
fr: Block Plus : Fil d’Ariane Omeka

source: Block Plus: Filter by year
fr: Block Plus : Filtre par année

source: Block Plus: Gallery (square)
fr: Block Plus : Galerie (carré)

source: Block Plus: Gallery (medium)
fr: Block Plus : Galerie (moyen)

source: Block Plus: Gallery (medium, link to item)
fr: Block Plus : Galerie (moyen, lien vers le contenu)

source: Block Plus: Subjects
fr: Block Plus : Sujets

source: Block Plus: Timeline list
fr: Block Plus : Liste pour Timeline

source: Block Plus: Browse preview (deprecated)
fr: Block Plus : Aperçu des ressources (obsolète)

source: Block Plus: Include html from group
fr: Block Plus : Ajout du html du groupe

source: Block Plus: Heading link
fr: Block Plus : Titre avec lien

source: Block Plus: Details/summary (start)
fr: Block Plus : Détails/sommaire (début)

source: Block Plus: Details/summary (end)
fr: Block Plus : Détails/sommaire (fin)

source: Block Plus: Accordion (h3)
fr: Block Plus : Accordéon (h3)

source: Block Plus: Anchor for headings
fr: Block Plus : Ancre pour les en-têtes

source: Block Plus: Dialog (class for name)
fr: Block Plus : Dialogue (classe pour nom)

source: Block Plus: Page header
fr: Block Plus : En-tête de page

source: Block Plus: Item with metadata (deprecated)
fr: Block Plus : Contenu avec métadonnées (obsolète)

source: Block Plus: List of pages (deprecated)
fr: Block Plus : Liste des pages (obsolète)

source: Block Plus: List of sites (deprecated)
fr: Block Plus : Liste des sites (obsolète)

source: Block Plus: Item showcase (deprecated)
fr: Block Plus: Vitrine de contenu (obsolète)
